{
  "defaultBlockedDomains": [
    "pornhub.com",
    "xvideos.com",
    "xnxx.com",
    "redtube.com",
    "youporn.com",
    "xhamster.com",
    "tube8.com",
    "spankbang.com",
    "txxx.com",
    "beeg.com",
    "tnaflix.com",
    "xvideos2.com",
    "drtuber.com",
    "youjizz.com",
    "upornia.com",
    "eporner.com",
    "nuvid.com",
    "porntrex.com",
    "hqporner.com",
    "porn300.com",
    "fapality.com",
    "4tube.com",
    "sunporno.com",
    "vporn.com",
    "porngo.com",
    "ixxx.com",
    "thumbzilla.com",
    "tnaflix.com",
    "pornhd.com",
    "xxxvideos.com",
    "motherless.com",
    "cam4.com",
    "chaturbate.com",
    "stripchat.com",
    "livejasmin.com",
    "bongacams.com",
    "onlyfans.com"
  ],
  "motivationalMessages": [
    "Reste fort ! Tu es à {days} jours !",
    "Le succès est une série de petites victoires. Continue !",
    "Chaque jour compte, tu es sur la bonne voie !",
    "La discipline d'aujourd'hui est la liberté de demain.",
    "Tu es plus fort que tes impulsions !",
    "Garde le cap, champion ! {days} jours de réussite !",
    "C'est dans les moments difficiles qu'on forge le caractère.",
    "Tu as déjà prouvé que tu peux le faire. Continue !",
    "Pense à l'objectif final. Tu y es presque !",
    "Chaque 'non' te rapproche de la victoire.",
    "La vraie force, c'est la maîtrise de soi.",
    "Tu n'es pas arrivé jusqu'ici pour abandonner maintenant !",
    "Respecte ton engagement envers toi-même.",
    "Le regret dure plus longtemps que la discipline.",
    "Transforme cette énergie en quelque chose de productif !",
    "30 jours de discipline = Une vie de fierté.",
    "Ton futur toi te remerciera.",
    "Ce n'est pas facile, mais ça en vaut la peine !",
    "Sois fier de chaque jour que tu accomplis.",
    "La victoire appartient à ceux qui persistent !"
  ],
  "blockedPageQuotes": [
    "La discipline est le pont entre les objectifs et l'accomplissement. - Jim Rohn",
    "La maîtrise de soi est la forme la plus pure de la sagesse.",
    "Ce n'est pas la volonté de gagner qui compte, c'est la volonté de se préparer à gagner.",
    "La vraie liberté commence avec la maîtrise de soi.",
    "Chaque bataille gagnée sur soi-même est une victoire éternelle.",
    "La discipline est le carburant de la réussite.",
    "Les champions se font dans l'entraînement, pas dans la compétition.",
    "Ton corps peut tout faire. C'est ton esprit qu'il faut convaincre.",
    "La persévérance est la clé de toutes les serrures.",
    "Sois plus fort que tes excuses.",
    "Le succès n'est pas final, l'échec n'est pas fatal : c'est le courage de continuer qui compte.",
    "La discipline d'aujourd'hui détermine ton futur.",
    "Tu n'as pas à être excellent pour commencer, mais tu dois commencer pour être excellent.",
    "La vraie force réside dans la capacité à se contrôler.",
    "Chaque jour est une nouvelle opportunité de prouver ta valeur."
  ]
}
